Repository: kirakosyan/FileStrider
Catalog: src/FileStrider.Infrastructure/Resources/Strings.*.resx
Languages: es, fr

# AppTitle
source: FileStrider - File & Folder Discovery Tool
es: FileStrider - Herramienta de Descubrimiento de Archivos y Carpetas
fr: FileStrider - Outil de Découverte de Fichiers et Dossiers

# AppSubtitle
source: Big File and Folder Discovery Tool
es: Herramienta de Descubrimiento de Archivos y Carpetas Grandes
fr: Outil de Découverte de Gros Fichiers et Dossiers

source: Scan Path:
es: Ruta de Escaneo:
fr: Chemin de Scan :

source: Browse...
es: Examinar...
fr: Parcourir...

source: 🔍 Quick Scan
es: 🔍 Escaneo Rápido
fr: 🔍 Scan Rapide

source: ▶️ Start Scan
es: ▶️ Iniciar Escaneo
fr: ▶️ Démarrer Scan

source: Include Hidden
es: Incluir Ocultos
fr: Inclure Cachés

source: Folders Only
es: Solo Carpetas
fr: Dossiers Seulement

# FoldersOnlyTooltip
source: Skip individual files for faster scanning
es: Omitir archivos individuales para escaneo más rápido
fr: Ignorer les fichiers individuels pour un scan plus rapide

# MinSize
source: Min Size (bytes):
es: Tamaño Mín (bytes):
fr: Taille Min (octets) :

source: 🔥 Largest Files
es: 🔥 Archivos Más Grandes
fr: 🔥 Plus Gros Fichiers

source: 📁 Largest Folders
es: 📁 Carpetas Más Grandes
fr: 📁 Plus Gros Dossiers

source: ❌ Cancel
es: ❌ Cancelar
fr: ❌ Annuler

source: 📄 Export CSV
es: 📄 Exportar CSV
fr: 📄 Exporter CSV

source: 📝 Export JSON
es: 📝 Exportar JSON
fr: 📝 Exporter JSON

source: Language:
es: Idioma:
fr: Langue :

source: Ready to scan...
es: Listo para escanear...
fr: Prêt à scanner...

# Scanning
source: Scanning in progress...
es: Escaneo en progreso...
fr: Scan en cours...

source: Size:
es: Tamaño:
fr: Taille :

source: Modified:
es: Modificado:
fr: Modifié :

source: Items:
es: Elementos:
fr: Éléments :

source: bytes
fr: octets

source: Error
fr: Erreur

source: Success
es: Éxito
fr: Succès

source: No Results
es: Sin Resultados
fr: Aucun Résultat

# NoResultsMessage
source: No scan results to export
es: No hay resultados de escaneo para exportar
fr: Aucun résultat de scan à exporter

# ExportSuccessMessage
source: Results exported to: {0}
es: Resultados exportados a: {0}
fr: Résultats exportés vers : {0}

# ExportFailedMessage
source: Export failed: {0}
es: Error en la exportación: {0}
fr: Échec de l'exportation : {0}

# FailedToOpenLocation
source: Failed to open location: {0}
es: Error al abrir ubicación: {0}
fr: Échec de l'ouverture de l'emplacement : {0}

source: Select Folder to Scan
es: Seleccionar Carpeta para Escanear
fr: Sélectionner le Dossier à Scanner

# DirectoryNotExist
source: Selected directory does not exist
es: El directorio seleccionado no existe
fr: Le répertoire sélectionné n'existe pas

source: Cancelled
es: Cancelado
fr: Annulé

# ScanCancelledMessage
source: Scan was cancelled by user
es: El escaneo fue cancelado por el usuario
fr: Le scan a été annulé par l'utilisateur

source: Complete
es: Completado
fr: Terminé

# ScanCompletedMessage
source: Scan completed successfully!
es: ¡Escaneo completado correctamente!
fr: Scan terminé avec succès !

# ScanCompletedStats
source: Scan completed! Found {0} files and {1} folders
es: ¡Escaneo completado! Se encontraron {0} archivos y {1} carpetas
fr: Scan terminé ! {0} fichiers et {1} dossiers trouvés

# ScanFailedMessage
source: Scan failed: {0}
es: Error en el escaneo: {0}
fr: Échec du scan : {0}

# AccessDeniedMessage
source: Access denied: {0}
es: Acceso denegado: {0}
fr: Accès refusé : {0}

# DirectoryNotFoundMessage
source: Directory not found: {0}
es: Directorio no encontrado: {0}
fr: Répertoire introuvable : {0}

# PathCopiedMessage
source: File path copied to clipboard
es: Ruta del archivo copiada al portapapeles
fr: Chemin du fichier copié dans le presse-papiers

# CopyFailedMessage
source: Failed to copy to clipboard: {0}
es: Error al copiar al portapapeles: {0}
fr: Échec de la copie dans le presse-papiers : {0}
